micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Source/Templates/iar/startup_stm32n647xx_fsbl.s
;********************************************************************************
;* File Name          : startup_stm32n647xx_fsbl.s
;* Author             : MCD Application Team
;* Description        : STM32N647xx Devices vector after boot ROM execution
;*                      This module performs:
;*                      - Set the initial SP
;*                      - Set the initial PC == _iar_program_start,
;*                      - Set the vector table entries with the exceptions ISR
;*                        address.
;*                      - Branches to main in the C library (which eventually
;*                        calls main()).
;*                      After Reset the Cortex-M55 processor is in Thread mode,
;*                      priority is Privileged, and the Stack is set to Main.
;********************************************************************************
;*
;* Copyright (c) 2023 STMicroelectronics.
;* All rights reserved.
;*
;* This software is licensed under terms that can be found in the LICENSE file
;* in the root directory of this software component.
;* If no LICENSE file comes with this software, it is provided AS-IS.
;*
;*******************************************************************************
;
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table
        PUBLIC  __Vectors
        PUBLIC  __Vectors_End
        PUBLIC  __Vectors_Size

        DATA
__vector_table

        DCD     sfe(CSTACK)                ; Initial Stack pointer
        DCD     Reset_Handler              ; Reset Handler

        DCD     NMI_Handler                ; NMI Handler
        DCD     HardFault_Handler          ; Hard Fault Handler
        DCD     MemManage_Handler          ; MPU Fault Handler
        DCD     BusFault_Handler           ; Bus Fault Handler
        DCD     UsageFault_Handler         ; Usage Fault Handler
        DCD     SecureFault_Handler        ; Secure Fault Handler
        DCD     0                          ; Reserved
        DCD     0                          ; Reserved
        DCD     0                          ; Reserved
        DCD     SVC_Handler                ; SVCall Handler
        DCD     DebugMon_Handler           ; Debug Monitor Handler
        DCD     0                          ; Reserved
        DCD     PendSV_Handler             ; PendSV Handler
        DCD     SysTick_Handler            ; SysTick Handler

        ; External Interrupts
        DCD     PVD_PVM_IRQHandler                ; PVD/PVM through EXTI Line detection
        DCD     0                                 ; Reserved
        DCD     DTS_IRQHandler                    ; Digital Temperature Sensor
        DCD     RCC_IRQHandler                    ; RCC global interrupts through EXTI Line detection
        DCD     LOCKUP_IRQHandler                 ; Processor_SAFETY_interrupt due lost LOCKUP
        DCD     CACHE_ECC_IRQHandler              ; Error ECC cache
        DCD     TCM_ECC_IRQHandler                ; Error ECC TCM
        DCD     BKP_ECC_IRQHandler                ; Error ECC BKP
        DCD     FPU_IRQHandler                    ; FPU
        DCD     0                                 ; Reserved
        DCD     RTC_S_IRQHandler                  ; RTC secure interrupts through the EXTI line
        DCD     TAMP_IRQHandler                   ; TAMP secure and non-secure interrupts through the EXTI line
        DCD     RIFSC_TAMPER_IRQHandler           ; RIF Tamper interrupts
        DCD     IAC_IRQHandler                    ; IAC interrupt
        DCD     RCC_S_IRQHandler                  ; RCC secure global interrupts through EXTI Line detection
        DCD     0                                 ; Reserved
        DCD     RTC_IRQHandler                    ; RTC non-secure interrupts through the EXTI line
        DCD     0                                 ; Reserved
        DCD     IWDG_IRQHandler                   ; Internal Watchdog
        DCD     WWDG_IRQHandler                   ; Window Watchdog
        DCD     EXTI0_IRQHandler                  ; EXTI Line0
        DCD     EXTI1_IRQHandler                  ; EXTI Line1
        DCD     EXTI2_IRQHandler                  ; EXTI Line2
        DCD     EXTI3_IRQHandler                  ; EXTI Line3
        DCD     EXTI4_IRQHandler                  ; EXTI Line4
        DCD     EXTI5_IRQHandler                  ; EXTI Line5
        DCD     EXTI6_IRQHandler                  ; EXTI Line6
        DCD     EXTI7_IRQHandler                  ; EXTI Line7
        DCD     EXTI8_IRQHandler                  ; EXTI Line8
        DCD     EXTI9_IRQHandler                  ; EXTI Line9
        DCD     EXTI10_IRQHandler                 ; EXTI Line10
        DCD     EXTI11_IRQHandler                 ; EXTI Line11
        DCD     EXTI12_IRQHandler                 ; EXTI Line12
        DCD     EXTI13_IRQHandler                 ; EXTI Line13
        DCD     EXTI14_IRQHandler                 ; EXTI Line14
        DCD     EXTI15_IRQHandler                 ; EXTI Line15
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     PKA_IRQHandler                    ; PKA
        DCD     HASH_IRQHandler                   ; HASH
        DCD     RNG_IRQHandler                    ; RNG
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     ADC1_2_IRQHandler                 ; ADC1 & ADC2
        DCD     CSI_IRQHandler                    ; CSI
        DCD     DCMIPP_IRQHandler                 ; DCMIPP
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     PAHB_ERR_IRQHandler               ; PAHB error interrupt
        DCD     NPU0_IRQHandler                   ; NPU mst_ints[1] line interrupt
        DCD     NPU1_IRQHandler                   ; NPU mst_ints[1] line interrupt
        DCD     NPU2_IRQHandler                   ; NPU mst_ints[2] line interrupt
        DCD     NPU3_IRQHandler                   ; NPU mst_ints[3] line interrupt
        DCD     CACHEAXI_IRQHandler               ; NPU CACHEAXI interrupt
        DCD     LTDC_LO_IRQHandler                ; LTDC low-layer interrupt
        DCD     LTDC_LO_ERR_IRQHandler            ; LTDC low-layer error interrupt
        DCD     DMA2D_IRQHandler                  ; DMA2D
        DCD     JPEG_IRQHandler                   ; JPEG
        DCD     VENC_IRQHandler                   ; VENC
        DCD     GFXMMU_IRQHandler                 ; GFXMMU
        DCD     GFXTIM_IRQHandler                 ; GFXTIM
        DCD     GPU2D_IRQHandler                  ; GPU2D
        DCD     GPU2D_ER_IRQHandler               ; GPU2D error
        DCD     ICACHE_IRQHandler                 ; GPU2D cache
        DCD     HPDMA1_Channel0_IRQHandler        ; HPDMA1 Channel 0
        DCD     HPDMA1_Channel1_IRQHandler        ; HPDMA1 Channel 1
        DCD     HPDMA1_Channel2_IRQHandler        ; HPDMA1 Channel 2
        DCD     HPDMA1_Channel3_IRQHandler        ; HPDMA1 Channel 3
        DCD     HPDMA1_Channel4_IRQHandler        ; HPDMA1 Channel 4
        DCD     HPDMA1_Channel5_IRQHandler        ; HPDMA1 Channel 5
        DCD     HPDMA1_Channel6_IRQHandler        ; HPDMA1 Channel 6
        DCD     HPDMA1_Channel7_IRQHandler        ; HPDMA1 Channel 7
        DCD     HPDMA1_Channel8_IRQHandler        ; HPDMA1 Channel 8
        DCD     HPDMA1_Channel9_IRQHandler        ; HPDMA1 Channel 9
        DCD     HPDMA1_Channel10_IRQHandler       ; HPDMA1 Channel 10
        DCD     HPDMA1_Channel11_IRQHandler       ; HPDMA1 Channel 11
        DCD     HPDMA1_Channel12_IRQHandler       ; HPDMA1 Channel 12
        DCD     HPDMA1_Channel13_IRQHandler       ; HPDMA1 Channel 13
        DCD     HPDMA1_Channel14_IRQHandler       ; HPDMA1 Channel 14
        DCD     HPDMA1_Channel15_IRQHandler       ; HPDMA1 Channel 15
        DCD     GPDMA1_Channel0_IRQHandler        ; GPDMA1 Channel 0
        DCD     GPDMA1_Channel1_IRQHandler        ; GPDMA1 Channel 1
        DCD     GPDMA1_Channel2_IRQHandler        ; GPDMA1 Channel 2
        DCD     GPDMA1_Channel3_IRQHandler        ; GPDMA1 Channel 3
        DCD     GPDMA1_Channel4_IRQHandler        ; GPDMA1 Channel 4
        DCD     GPDMA1_Channel5_IRQHandler        ; GPDMA1 Channel 5
        DCD     GPDMA1_Channel6_IRQHandler        ; GPDMA1 Channel 6
        DCD     GPDMA1_Channel7_IRQHandler        ; GPDMA1 Channel 7
        DCD     GPDMA1_Channel8_IRQHandler        ; GPDMA1 Channel 8
        DCD     GPDMA1_Channel9_IRQHandler        ; GPDMA1 Channel 9
        DCD     GPDMA1_Channel10_IRQHandler       ; GPDMA1 Channel 10
        DCD     GPDMA1_Channel11_IRQHandler       ; GPDMA1 Channel 11
        DCD     GPDMA1_Channel12_IRQHandler       ; GPDMA1 Channel 12
        DCD     GPDMA1_Channel13_IRQHandler       ; GPDMA1 Channel 13
        DCD     GPDMA1_Channel14_IRQHandler       ; GPDMA1 Channel 14
        DCD     GPDMA1_Channel15_IRQHandler       ; GPDMA1 Channel 15
        DCD     I2C1_EV_IRQHandler                ; I2C1 Event
        DCD     I2C1_ER_IRQHandler                ; I2C1 Error
        DCD     I2C2_EV_IRQHandler                ; I2C2 Event
        DCD     I2C2_ER_IRQHandler                ; I2C2 Error
        DCD     I2C3_EV_IRQHandler                ; I2C3 Event
        DCD     I2C3_ER_IRQHandler                ; I2C3 Error
        DCD     I2C4_EV_IRQHandler                ; I2C4 Event
        DCD     I2C4_ER_IRQHandler                ; I2C4 Error
        DCD     I3C1_EV_IRQHandler                ; I3C1 Event
        DCD     I3C1_ER_IRQHandler                ; I3C1 Error
        DCD     I3C2_EV_IRQHandler                ; I3C2 Event
        DCD     I3C2_ER_IRQHandler                ; I3C2 Error
        DCD     TIM1_BRK_IRQHandler               ; TIM1 Break
        DCD     TIM1_UP_IRQHandler                ; TIM1 Update
        DCD     TIM1_TRG_COM_IRQHandler           ; TIM1 Trigger and Commutation
        DCD     TIM1_CC_IRQHandler                ; TIM1 Capture Compare
        DCD     TIM2_IRQHandler                   ; TIM2
        DCD     TIM3_IRQHandler                   ; TIM3
        DCD     TIM4_IRQHandler                   ; TIM4
        DCD     TIM5_IRQHandler                   ; TIM5
        DCD     TIM6_IRQHandler                   ; TIM6
        DCD     TIM7_IRQHandler                   ; TIM7
        DCD     TIM8_BRK_IRQHandler               ; TIM8 Break
        DCD     TIM8_UP_IRQHandler                ; TIM8 Update
        DCD     TIM8_TRG_COM_IRQHandler           ; TIM8 Trigger and Commutation
        DCD     TIM8_CC_IRQHandler                ; TIM8 Capture Compare
        DCD     TIM9_IRQHandler                   ; TIM9
        DCD     TIM10_IRQHandler                  ; TIM10
        DCD     TIM11_IRQHandler                  ; TIM11
        DCD     TIM12_IRQHandler                  ; TIM12
        DCD     TIM13_IRQHandler                  ; TIM13
        DCD     TIM14_IRQHandler                  ; TIM14
        DCD     TIM15_IRQHandler                  ; TIM15
        DCD     TIM16_IRQHandler                  ; TIM16
        DCD     TIM17_IRQHandler                  ; TIM17
        DCD     TIM18_IRQHandler                  ; TIM18
        DCD     LPTIM1_IRQHandler                 ; LP TIM1
        DCD     LPTIM2_IRQHandler                 ; LP TIM2
        DCD     LPTIM3_IRQHandler                 ; LP TIM3
        DCD     LPTIM4_IRQHandler                 ; LP TIM4
        DCD     LPTIM5_IRQHandler                 ; LP TIM5
        DCD     ADF1_FLT0_IRQHandler              ; ADF1 Filter 0
        DCD     MDF1_FLT0_IRQHandler              ; MDF1 Filter 0
        DCD     MDF1_FLT1_IRQHandler              ; MDF1 Filter 1
        DCD     MDF1_FLT2_IRQHandler              ; MDF1 Filter 2
        DCD     MDF1_FLT3_IRQHandler              ; MDF1 Filter 3
        DCD     MDF1_FLT4_IRQHandler              ; MDF1 Filter 4
        DCD     MDF1_FLT5_IRQHandler              ; MDF1 Filter 5
        DCD     SAI1_A_IRQHandler                 ; Serial Audio Interface 1 block A interrupt
        DCD     SAI1_B_IRQHandler                 ; Serial Audio Interface 1 block B interrupt
        DCD     SAI2_A_IRQHandler                 ; Serial Audio Interface 2 block A interrupt
        DCD     SAI2_B_IRQHandler                 ; Serial Audio Interface 2 block B interrupt
        DCD     SPDIFRX1_IRQHandler               ; SPDIFRX1
        DCD     SPI1_IRQHandler                   ; SPI1
        DCD     SPI2_IRQHandler                   ; SPI2
        DCD     SPI3_IRQHandler                   ; SPI3
        DCD     SPI4_IRQHandler                   ; SPI4
        DCD     SPI5_IRQHandler                   ; SPI5
        DCD     SPI6_IRQHandler                   ; SPI6
        DCD     USART1_IRQHandler                 ; USART1
        DCD     USART2_IRQHandler                 ; USART2
        DCD     USART3_IRQHandler                 ; USART3
        DCD     UART4_IRQHandler                  ; UART4
        DCD     UART5_IRQHandler                  ; UART5
        DCD     USART6_IRQHandler                 ; USART6
        DCD     UART7_IRQHandler                  ; UART7
        DCD     UART8_IRQHandler                  ; UART8
        DCD     UART9_IRQHandler                  ; UART9
        DCD     USART10_IRQHandler                ; USART10
        DCD     LPUART1_IRQHandler                ; LP UART1
        DCD     XSPI1_IRQHandler                  ; XSPI1 global interrupt
        DCD     XSPI2_IRQHandler                  ; XSPI2 global interrupt
        DCD     XSPI3_IRQHandler                  ; XSPI3 global interrupt
        DCD     FMC_IRQHandler                    ; FMC
        DCD     SDMMC1_IRQHandler                 ; SDMMC1
        DCD     SDMMC2_IRQHandler                 ; SDMMC2
        DCD     UCPD1_IRQHandler                  ; UCPD1
        DCD     USB1_OTG_HS_IRQHandler            ; USB1 OTG HS
        DCD     USB2_OTG_HS_IRQHandler            ; USB2 OTG HS
        DCD     ETH1_IRQHandler                   ; Ethernet
        DCD     FDCAN1_IT0_IRQHandler             ; FDCAN1 Interrupt 0
        DCD     FDCAN1_IT1_IRQHandler             ; FDCAN1 Interrupt 1
        DCD     FDCAN2_IT0_IRQHandler             ; FDCAN2 Interrupt 0
        DCD     FDCAN2_IT1_IRQHandler             ; FDCAN2 Interrupt 1
        DCD     FDCAN3_IT0_IRQHandler             ; FDCAN3 Interrupt 0
        DCD     FDCAN3_IT1_IRQHandler             ; FDCAN3 Interrupt 1
        DCD     FDCAN_CU_IRQHandler               ; FDCAN clock unit interrupt
        DCD     MDIOS_IRQHandler                  ; MDIOS
        DCD     DCMI_PSSI_IRQHandler              ; DCMI_PSSI
        DCD     WAKEUP_PIN_IRQHandler             ; Wake-up pins interrupt
        DCD     CTI_INT0_IRQHandler               ; CTI INT0 interrupt
        DCD     CTI_INT1_IRQHandler               ; CTI INT1 interrupt
        DCD     0                                 ; Reserved
        DCD     LTDC_UP_IRQHandler                ; LTDC up-layer interrupt
        DCD     LTDC_UP_ERR_IRQHandler            ; LTDC up-layer error interrupt
__Vectors_End

__Vectors       EQU   __vector_table
__Vectors_Size  EQU   __Vectors_End - __Vectors

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB
        PUBWEAK Reset_Handler
        SECTION .text:CODE:NOROOT:REORDER(2)
Reset_Handler

        LDR     LR, =0xFFFFFFFF
        LDR     R0, =sfb(CSTACK)
        MSR     MSPLIM, R0               ; Set Stack Pointer Limit
        LDR     SP, =sfe(CSTACK)         ; Set Stack Pointer
        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
NMI_Handler
        B NMI_Handler

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
HardFault_Handler
        B HardFault_Handler

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
MemManage_Handler
        B MemManage_Handler

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
BusFault_Handler
        B BusFault_Handler

